MikroElektronika/core_packages/PIC/XC8/def/PIC18F4331/mcu.h
// Register: QEICON
#define QEICON QEICON
extern volatile unsigned char           QEICON              __at(0xFB6);
#ifndef _LIB_BUILD
asm("QEICON equ 0FB6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned UP_NOT_DOWN            :1;
    };
    struct {
        unsigned                        :7;
        unsigned NOT_VELM               :1;
    };
    struct {
        unsigned PDEC                   :2;
        unsigned QEIM                   :3;
        unsigned UP_nDOWN               :1;
        unsigned ERROR                  :1;
        unsigned nVELM                  :1;
    };
    struct {
        unsigned PDEC0                  :1;
        unsigned PDEC1                  :1;
        unsigned QEIM0                  :1;
        unsigned QEIM1                  :1;
        unsigned QEIM2                  :1;
        unsigned UP_DOWN                :1;
        unsigned                        :1;
        unsigned VELM                   :1;
    };
    struct {
        unsigned                        :5;
        unsigned UP                     :1;
    };
    struct {
        unsigned                        :5;
        unsigned DOWN                   :1;
    };
    struct {
        unsigned                        :5;
        unsigned NOT_DOWN               :1;
    };
    struct {
        unsigned                        :5;
        unsigned nDOWN                  :1;
    };
    struct {
        unsigned                        :5;
        unsigned UPDOWN                 :1;
    };
} QEICONbits_t;
extern volatile QEICONbits_t QEICONbits __at(0xFB6);
// bitfield macros
#define _QEICON_UP_NOT_DOWN_POSN                            0x5
#define _QEICON_UP_NOT_DOWN_POSITION                        0x5
#define _QEICON_UP_NOT_DOWN_SIZE                            0x1
#define _QEICON_UP_NOT_DOWN_LENGTH                          0x1
#define _QEICON_UP_NOT_DOWN_MASK                            0x20
#define _QEICON_NOT_VELM_POSN                               0x7
#define _QEICON_NOT_VELM_POSITION                           0x7
#define _QEICON_NOT_VELM_SIZE                               0x1
#define _QEICON_NOT_VELM_LENGTH                             0x1
#define _QEICON_NOT_VELM_MASK                               0x80
#define _QEICON_PDEC_POSN                                   0x0
#define _QEICON_PDEC_POSITION                               0x0
#define _QEICON_PDEC_SIZE                                   0x2
#define _QEICON_PDEC_LENGTH                                 0x2
#define _QEICON_PDEC_MASK                                   0x3
#define _QEICON_QEIM_POSN                                   0x2
#define _QEICON_QEIM_POSITION                               0x2
#define _QEICON_QEIM_SIZE                                   0x3
#define _QEICON_QEIM_LENGTH                                 0x3
#define _QEICON_QEIM_MASK                                   0x1C
#define _QEICON_UP_nDOWN_POSN                               0x5
#define _QEICON_UP_nDOWN_POSITION                           0x5
#define _QEICON_UP_nDOWN_SIZE                               0x1
#define _QEICON_UP_nDOWN_LENGTH                             0x1
#define _QEICON_UP_nDOWN_MASK                               0x20
#define _QEICON_ERROR_POSN                                  0x6
#define _QEICON_ERROR_POSITION                              0x6
#define _QEICON_ERROR_SIZE                                  0x1
#define _QEICON_ERROR_LENGTH                                0x1
#define _QEICON_ERROR_MASK                                  0x40
#define _QEICON_nVELM_POSN                                  0x7
#define _QEICON_nVELM_POSITION                              0x7
#define _QEICON_nVELM_SIZE                                  0x1
#define _QEICON_nVELM_LENGTH                                0x1
#define _QEICON_nVELM_MASK                                  0x80
#define _QEICON_PDEC0_POSN                                  0x0
#define _QEICON_PDEC0_POSITION                              0x0
#define _QEICON_PDEC0_SIZE                                  0x1
#define _QEICON_PDEC0_LENGTH                                0x1
#define _QEICON_PDEC0_MASK                                  0x1
#define _QEICON_PDEC1_POSN                                  0x1
#define _QEICON_PDEC1_POSITION                              0x1
#define _QEICON_PDEC1_SIZE                                  0x1
#define _QEICON_PDEC1_LENGTH                                0x1
#define _QEICON_PDEC1_MASK                                  0x2
#define _QEICON_QEIM0_POSN                                  0x2
#define _QEICON_QEIM0_POSITION                              0x2
#define _QEICON_QEIM0_SIZE                                  0x1
#define _QEICON_QEIM0_LENGTH                                0x1
#define _QEICON_QEIM0_MASK                                  0x4
#define _QEICON_QEIM1_POSN                                  0x3
#define _QEICON_QEIM1_POSITION                              0x3
#define _QEICON_QEIM1_SIZE                                  0x1
#define _QEICON_QEIM1_LENGTH                                0x1
#define _QEICON_QEIM1_MASK                                  0x8
#define _QEICON_QEIM2_POSN                                  0x4
#define _QEICON_QEIM2_POSITION                              0x4
#define _QEICON_QEIM2_SIZE                                  0x1
#define _QEICON_QEIM2_LENGTH                                0x1
#define _QEICON_QEIM2_MASK                                  0x10
#define _QEICON_UP_DOWN_POSN                                0x5
#define _QEICON_UP_DOWN_POSITION                            0x5
#define _QEICON_UP_DOWN_SIZE                                0x1
#define _QEICON_UP_DOWN_LENGTH                              0x1
#define _QEICON_UP_DOWN_MASK                                0x20
#define _QEICON_VELM_POSN                                   0x7
#define _QEICON_VELM_POSITION                               0x7
#define _QEICON_VELM_SIZE                                   0x1
#define _QEICON_VELM_LENGTH                                 0x1
#define _QEICON_VELM_MASK                                   0x80
#define _QEICON_UP_POSN                                     0x5
#define _QEICON_UP_POSITION                                 0x5
#define _QEICON_UP_SIZE                                     0x1
#define _QEICON_UP_LENGTH                                   0x1
#define _QEICON_UP_MASK                                     0x20
#define _QEICON_DOWN_POSN                                   0x5
#define _QEICON_DOWN_POSITION                               0x5
#define _QEICON_DOWN_SIZE                                   0x1
#define _QEICON_DOWN_LENGTH                                 0x1
#define _QEICON_DOWN_MASK                                   0x20
#define _QEICON_NOT_DOWN_POSN                               0x5
#define _QEICON_NOT_DOWN_POSITION                           0x5
#define _QEICON_NOT_DOWN_SIZE                               0x1
#define _QEICON_NOT_DOWN_LENGTH                             0x1
#define _QEICON_NOT_DOWN_MASK                               0x20
#define _QEICON_nDOWN_POSN                                  0x5
#define _QEICON_nDOWN_POSITION                              0x5
#define _QEICON_nDOWN_SIZE                                  0x1
#define _QEICON_nDOWN_LENGTH                                0x1
#define _QEICON_nDOWN_MASK                                  0x20
#define _QEICON_UPDOWN_POSN                                 0x5
#define _QEICON_UPDOWN_POSITION                             0x5
#define _QEICON_UPDOWN_SIZE                                 0x1
#define _QEICON_UPDOWN_LENGTH                               0x1
#define _QEICON_UPDOWN_MASK                                 0x20

// Register: T5CON
#define T5CON T5CON
extern volatile unsigned char           T5CON               __at(0xFB7);
#ifndef _LIB_BUILD
asm("T5CON equ 0FB7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned NOT_T5SYNC             :1;
    };
    struct {
        unsigned                        :6;
        unsigned NOT_RESEN              :1;
    };
    struct {
        unsigned TMR5ON                 :1;
        unsigned TMR5CS                 :1;
        unsigned nT5SYNC                :1;
        unsigned T5PS                   :2;
        unsigned T5MOD                  :1;
        unsigned nRESEN                 :1;
        unsigned T5SEN                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned T5SYNC                 :1;
        unsigned T5PS0                  :1;
        unsigned T5PS1                  :1;
        unsigned                        :1;
        unsigned RESEN                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned RD165                  :1;
        unsigned                        :1;
        unsigned SOSCEN5                :1;
    };
} T5CONbits_t;
extern volatile T5CONbits_t T5CONbits __at(0xFB7);
// bitfield macros
#define _T5CON_NOT_T5SYNC_POSN                              0x2
#define _T5CON_NOT_T5SYNC_POSITION                          0x2
#define _T5CON_NOT_T5SYNC_SIZE                              0x1
#define _T5CON_NOT_T5SYNC_LENGTH                            0x1
#define _T5CON_NOT_T5SYNC_MASK                              0x4
#define _T5CON_NOT_RESEN_POSN                               0x6
#define _T5CON_NOT_RESEN_POSITION                           0x6
#define _T5CON_NOT_RESEN_SIZE                               0x1
#define _T5CON_NOT_RESEN_LENGTH                             0x1
#define _T5CON_NOT_RESEN_MASK                               0x40
#define _T5CON_TMR5ON_POSN                                  0x0
#define _T5CON_TMR5ON_POSITION                              0x0
#define _T5CON_TMR5ON_SIZE                                  0x1
#define _T5CON_TMR5ON_LENGTH                                0x1
#define _T5CON_TMR5ON_MASK                                  0x1
#define _T5CON_TMR5CS_POSN                                  0x1
#define _T5CON_TMR5CS_POSITION                              0x1
#define _T5CON_TMR5CS_SIZE                                  0x1
#define _T5CON_TMR5CS_LENGTH                                0x1
#define _T5CON_TMR5CS_MASK                                  0x2
#define _T5CON_nT5SYNC_POSN                                 0x2
#define _T5CON_nT5SYNC_POSITION                             0x2
#define _T5CON_nT5SYNC_SIZE                                 0x1
#define _T5CON_nT5SYNC_LENGTH                               0x1
#define _T5CON_nT5SYNC_MASK                                 0x4
#define _T5CON_T5PS_POSN                                    0x3
#define _T5CON_T5PS_POSITION                                0x3
#define _T5CON_T5PS_SIZE                                    0x2
#define _T5CON_T5PS_LENGTH                                  0x2
#define _T5CON_T5PS_MASK                                    0x18
#define _T5CON_T5MOD_POSN                                   0x5
#define _T5CON_T5MOD_POSITION                               0x5
#define _T5CON_T5MOD_SIZE                                   0x1
#define _T5CON_T5MOD_LENGTH                                 0x1
#define _T5CON_T5MOD_MASK                                   0x20
#define _T5CON_nRESEN_POSN                                  0x6
#define _T5CON_nRESEN_POSITION                              0x6
#define _T5CON_nRESEN_SIZE                                  0x1
#define _T5CON_nRESEN_LENGTH                                0x1
#define _T5CON_nRESEN_MASK                                  0x40
#define _T5CON_T5SEN_POSN                                   0x7
#define _T5CON_T5SEN_POSITION                               0x7
#define _T5CON_T5SEN_SIZE                                   0x1
#define _T5CON_T5SEN_LENGTH                                 0x1
#define _T5CON_T5SEN_MASK                                   0x80
#define _T5CON_T5SYNC_POSN                                  0x2
#define _T5CON_T5SYNC_POSITION                              0x2
#define _T5CON_T5SYNC_SIZE                                  0x1
#define _T5CON_T5SYNC_LENGTH                                0x1
#define _T5CON_T5SYNC_MASK                                  0x4
#define _T5CON_T5PS0_POSN                                   0x3
#define _T5CON_T5PS0_POSITION                               0x3
#define _T5CON_T5PS0_SIZE                                   0x1
#define _T5CON_T5PS0_LENGTH                                 0x1
#define _T5CON_T5PS0_MASK                                   0x8
#define _T5CON_T5PS1_POSN                                   0x4
#define _T5CON_T5PS1_POSITION                               0x4
#define _T5CON_T5PS1_SIZE                                   0x1
#define _T5CON_T5PS1_LENGTH                                 0x1
#define _T5CON_T5PS1_MASK                                   0x10
#define _T5CON_RESEN_POSN                                   0x6
#define _T5CON_RESEN_POSITION                               0x6
#define _T5CON_RESEN_SIZE                                   0x1
#define _T5CON_RESEN_LENGTH                                 0x1
#define _T5CON_RESEN_MASK                                   0x40
#define _T5CON_RD165_POSN                                   0x1
#define _T5CON_RD165_POSITION                               0x1
#define _T5CON_RD165_SIZE                                   0x1
#define _T5CON_RD165_LENGTH                                 0x1
#define _T5CON_RD165_MASK                                   0x2
#define _T5CON_SOSCEN5_POSN                                 0x3
#define _T5CON_SOSCEN5_POSITION                             0x3
#define _T5CON_SOSCEN5_SIZE                                 0x1
#define _T5CON_SOSCEN5_LENGTH                               0x1
#define _T5CON_SOSCEN5_MASK                                 0x8

// Register: ANSEL0
#define ANSEL0 ANSEL0
extern volatile unsigned char           ANSEL0              __at(0xFB8);
#ifndef _LIB_BUILD
asm("ANSEL0 equ 0FB8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANS0                   :1;
        unsigned ANS1                   :1;
        unsigned ANS2                   :1;
        unsigned ANS3                   :1;
        unsigned ANS4                   :1;
        unsigned ANS5                   :1;
        unsigned ANS6                   :1;
        unsigned ANS7                   :1;
    };
} ANSEL0bits_t;
extern volatile ANSEL0bits_t ANSEL0bits __at(0xFB8);
// bitfield macros
#define _ANSEL0_ANS0_POSN                                   0x0
#define _ANSEL0_ANS0_POSITION                               0x0
#define _ANSEL0_ANS0_SIZE                                   0x1
#define _ANSEL0_ANS0_LENGTH                                 0x1
#define _ANSEL0_ANS0_MASK                                   0x1
#define _ANSEL0_ANS1_POSN                                   0x1
#define _ANSEL0_ANS1_POSITION                               0x1
#define _ANSEL0_ANS1_SIZE                                   0x1
#define _ANSEL0_ANS1_LENGTH                                 0x1
#define _ANSEL0_ANS1_MASK                                   0x2
#define _ANSEL0_ANS2_POSN                                   0x2
#define _ANSEL0_ANS2_POSITION                               0x2
#define _ANSEL0_ANS2_SIZE                                   0x1
#define _ANSEL0_ANS2_LENGTH                                 0x1
#define _ANSEL0_ANS2_MASK                                   0x4
#define _ANSEL0_ANS3_POSN                                   0x3
#define _ANSEL0_ANS3_POSITION                               0x3
#define _ANSEL0_ANS3_SIZE                                   0x1
#define _ANSEL0_ANS3_LENGTH                                 0x1
#define _ANSEL0_ANS3_MASK                                   0x8
#define _ANSEL0_ANS4_POSN                                   0x4
#define _ANSEL0_ANS4_POSITION                               0x4
#define _ANSEL0_ANS4_SIZE                                   0x1
#define _ANSEL0_ANS4_LENGTH                                 0x1
#define _ANSEL0_ANS4_MASK                                   0x10
#define _ANSEL0_ANS5_POSN                                   0x5
#define _ANSEL0_ANS5_POSITION                               0x5
#define _ANSEL0_ANS5_SIZE                                   0x1
#define _ANSEL0_ANS5_LENGTH                                 0x1
#define _ANSEL0_ANS5_MASK                                   0x20
#define _ANSEL0_ANS6_POSN                                   0x6
#define _ANSEL0_ANS6_POSITION                               0x6
#define _ANSEL0_ANS6_SIZE                                   0x1
#define _ANSEL0_ANS6_LENGTH                                 0x1
#define _ANSEL0_ANS6_MASK                                   0x40
#define _ANSEL0_ANS7_POSN                                   0x7
#define _ANSEL0_ANS7_POSITION                               0x7
#define _ANSEL0_ANS7_SIZE                                   0x1
#define _ANSEL0_ANS7_LENGTH                                 0x1
#define _ANSEL0_ANS7_MASK                                   0x80

// Register: ANSEL1
#define ANSEL1 ANSEL1
extern volatile unsigned char           ANSEL1              __at(0xFB9);
#ifndef _LIB_BUILD
asm("ANSEL1 equ 0FB9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANS8                   :1;
    };
} ANSEL1bits_t;
extern volatile ANSEL1bits_t ANSEL1bits __at(0xFB9);
// bitfield macros
#define _ANSEL1_ANS8_POSN                                   0x0
#define _ANSEL1_ANS8_POSITION                               0x0
#define _ANSEL1_ANS8_SIZE                                   0x1
#define _ANSEL1_ANS8_LENGTH                                 0x1
#define _ANSEL1_ANS8_MASK                                   0x1

// Register: CCP2CON
#define CCP2CON CCP2CON
extern volatile unsigned char           CCP2CON             __at(0xFBA);
#ifndef _LIB_BUILD
asm("CCP2CON equ 0FBAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP2M                  :4;
        unsigned DC2B                   :2;
    };
    struct {
        unsigned CCP2M0                 :1;
        unsigned CCP2M1                 :1;
        unsigned CCP2M2                 :1;
        unsigned CCP2M3                 :1;
        unsigned CCP2Y                  :1;
        unsigned CCP2X                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned DC2B0                  :1;
        unsigned DC2B1                  :1;
    };
} CCP2CONbits_t;
extern volatile CCP2CONbits_t CCP2CONbits __at(0xFBA);
// bitfield macros
#define _CCP2CON_CCP2M_POSN                                 0x0
#define _CCP2CON_CCP2M_POSITION                             0x0
#define _CCP2CON_CCP2M_SIZE                                 0x4
#define _CCP2CON_CCP2M_LENGTH                               0x4
#define _CCP2CON_CCP2M_MASK                                 0xF
#define _CCP2CON_DC2B_POSN                                  0x4
#define _CCP2CON_DC2B_POSITION                              0x4
#define _CCP2CON_DC2B_SIZE                                  0x2
#define _CCP2CON_DC2B_LENGTH                                0x2
#define _CCP2CON_DC2B_MASK                                  0x30
#define _CCP2CON_CCP2M0_POSN                                0x0
#define _CCP2CON_CCP2M0_POSITION                            0x0
#define _CCP2CON_CCP2M0_SIZE                                0x1
#define _CCP2CON_CCP2M0_LENGTH                              0x1
#define _CCP2CON_CCP2M0_MASK                                0x1
#define _CCP2CON_CCP2M1_POSN                                0x1
#define _CCP2CON_CCP2M1_POSITION                            0x1
#define _CCP2CON_CCP2M1_SIZE                                0x1
#define _CCP2CON_CCP2M1_LENGTH                              0x1
#define _CCP2CON_CCP2M1_MASK                                0x2
#define _CCP2CON_CCP2M2_POSN                                0x2
#define _CCP2CON_CCP2M2_POSITION                            0x2
#define _CCP2CON_CCP2M2_SIZE                                0x1
#define _CCP2CON_CCP2M2_LENGTH                              0x1
#define _CCP2CON_CCP2M2_MASK                                0x4
#define _CCP2CON_CCP2M3_POSN                                0x3
#define _CCP2CON_CCP2M3_POSITION                            0x3
#define _CCP2CON_CCP2M3_SIZE                                0x1
#define _CCP2CON_CCP2M3_LENGTH                              0x1
#define _CCP2CON_CCP2M3_MASK                                0x8
#define _CCP2CON_CCP2Y_POSN                                 0x4
#define _CCP2CON_CCP2Y_POSITION                             0x4
#define _CCP2CON_CCP2Y_SIZE                                 0x1
#define _CCP2CON_CCP2Y_LENGTH                               0x1
#define _CCP2CON_CCP2Y_MASK                                 0x10
#define _CCP2CON_CCP2X_POSN                                 0x5
#define _CCP2CON_CCP2X_POSITION                             0x5
#define _CCP2CON_CCP2X_SIZE                                 0x1
#define _CCP2CON_CCP2X_LENGTH                               0x1
#define _CCP2CON_CCP2X_MASK                                 0x20
#define _CCP2CON_DC2B0_POSN                                 0x4
#define _CCP2CON_DC2B0_POSITION                             0x4
#define _CCP2CON_DC2B0_SIZE                                 0x1
#define _CCP2CON_DC2B0_LENGTH                               0x1
#define _CCP2CON_DC2B0_MASK                                 0x10
#define _CCP2CON_DC2B1_POSN                                 0x5
#define _CCP2CON_DC2B1_POSITION                             0x5
#define _CCP2CON_DC2B1_SIZE                                 0x1
#define _CCP2CON_DC2B1_LENGTH                               0x1
#define _CCP2CON_DC2B1_MASK                                 0x20

// Register: CCPR2
#define CCPR2 CCPR2
extern volatile unsigned short          CCPR2               __at(0xFBB);
#ifndef _LIB_BUILD
asm("CCPR2 equ 0FBBh");
#endif

// Register: CCPR2L
#define CCPR2L CCPR2L
extern volatile unsigned char           CCPR2L              __at(0xFBB);
#ifndef _LIB_BUILD
asm("CCPR2L equ 0FBBh");
#endif

